outofjungle/M5Atom-Serial-Switch-Sensor/sdkconfig.defaults
# M5Atom Serial Switch Sensor - SDK Configuration
# ESP32-S3 (M5Stack AtomS3 Lite). See docs/01-hardware-atoms3-lite.md and
# docs/02-usb-device-and-descriptors.md.

# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash size: this board has 8 MB.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Console: routed to nothing. The application sends its own log output to
# CDC1 instead. See docs/08-flow-control-and-backpressure.md.
CONFIG_ESP_CONSOLE_NONE=y

# TinyUSB: two CDC-ACM ports (docs/02-usb-device-and-descriptors.md).
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=2
CONFIG_TINYUSB_CDC_RX_BUFSIZE=512
CONFIG_TINYUSB_CDC_TX_BUFSIZE=1024

# USB identity: Espressif's VID, with a placeholder PID pending
# registration through github.com/espressif/usb-pids. See
# docs/02-usb-device-and-descriptors.md.
CONFIG_TINYUSB_DESC_USE_ESPRESSIF_VID=y
CONFIG_TINYUSB_DESC_USE_DEFAULT_PID=n
CONFIG_TINYUSB_DESC_CUSTOM_PID=0x8001
CONFIG_TINYUSB_DESC_MANUFACTURER_STRING="M5Atom Project"
CONFIG_TINYUSB_DESC_PRODUCT_STRING="Switch Sensor"

# FreeRTOS
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y

# Memory
CONFIG_NEWLIB_NANO_FORMAT=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
